### Задача 1
Подгрузите данные 'data.csv' (возможно, придется указать кодировку encoding сp1250) в переменную data.

Создайте новый столбец TotalCost со значениями Quantity * UnitPrice. Сделайте resampling данных в еженедельные со значениями суммы по столбцам TotalCost.

**Решение:**

In [ ]:
import pandas as pd                        # Подключаем библиотеку pandas

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
data = pd.read_csv('/content/drive/MyDrive/NU/04 Pandas/data.csv', encoding = 'cp1250')

# В качестве индекса используем колонку InvoiceDate преобразованную в DateTime index
data.index = pd.to_datetime(data.InvoiceDate)     

# Удаляем колонкуInvoiceDate
data.drop('InvoiceDate', axis =1, inplace = True)

In [ ]:
#Добавим новую колонку TotalCost со значениями Quantity * UnitPrice (Количество * Цена)
data['TotalCost'] = data['Quantity'] * data['UnitPrice']

# Посмотрим полученный результат
data

                    InvoiceNo StockCode  ...         Country  TotalCost
InvoiceDate                              ...
2010-12-01 08:26:00    536365    85123A  ...  United Kingdom      15.30
2010-12-01 08:26:00    536365     71053  ...  United Kingdom      20.34
2010-12-01 08:26:00    536365    84406B  ...  United Kingdom      22.00
2010-12-01 08:26:00    536365    84029G  ...  United Kingdom      20.34
2010-12-01 08:26:00    536365    84029E  ...  United Kingdom      20.34
...                       ...       ...  ...             ...        ...
2011-12-09 12:50:00    581587     22613  ...          France      10.20
2011-12-09 12:50:00    581587     22899  ...          France      12.60
2011-12-09 12:50:00    581587     23254  ...          France      16.60
2011-12-09 12:50:00    581587     23255  ...          France      16.60
2011-12-09 12:50:00    581587     22138  ...          France      14.85

[541909 rows x 8 columns]

In [ ]:
#Resampling суммы (sum) TotalCost
# Начало ('W') недели (если не указать то по умолчанию будет воскресенье SUN) И сумма за неделю будет считаться с понедельника по воскресенье включительно
# Но если поставить ('W - MON') понедельник, то итоговая сумма будет считаться со вторника по понедельника следующей недели включительно.

data.TotalCost.resample ('W').sum()

InvoiceDate
2010-12-05    181847.250
2010-12-12    270287.030
2010-12-19    207052.170
2010-12-26     89770.570
2011-01-02         0.000
2011-01-09     93720.930
2011-01-16    190994.960
2011-01-23    133782.910
2011-01-30    119136.810
2011-02-06    123642.180
2011-02-13    102296.930
2011-02-20    139664.580
2011-02-27    133069.930
2011-03-06    130435.560
2011-03-13    129180.960
2011-03-20    145262.610
2011-03-27    147909.800
2011-04-03    183501.710
2011-04-10    121598.220
2011-04-17    147459.771
2011-04-24    115461.250
2011-05-01     84382.660
2011-05-08    130354.310
2011-05-15    205445.230
2011-05-22    198031.530
2011-05-29    160569.820
2011-06-05    116932.520
2011-06-12    177916.870
2011-06-19    184016.500
2011-06-26    117086.710
2011-07-03    136287.440
2011-07-10    174659.170
2011-07-17    124163.170
2011-07-24    182513.960
2011-07-31    180814.851
2011-08-07    153176.200
2011-08-14    161417.020
2011-08-21    170724.890
2011-08-28    149603.500
2011-09-04    143819.060
2011-09-11    190513.470
2011-09-18    211722.620
2011-09-25    326156.721
2011-10-02    206858.231
2011-10-09    302466.590
2011-10-16    205734.640
2011-10-23    263762.220
2011-10-30    238642.190
2011-11-06    288266.770
2011-11-13    346560.140
2011-11-20    380407.570
2011-11-27    308185.020
2011-12-04    319874.990
2011-12-11    300605.220
Freq: W-SUN, Name: TotalCost, dtype: float64

### Задача 2

Посчитайте скользящее недельное среднее суммы ежедневных заказов. Для этого
* сделайте resampling в ежедневные данные,
* посчитайте скользящее среднее за 7 дней по столбцу TotalCost.

*Для решения второй части данной задачи потребуется самостоятельно найти способ определения скользящего среднего.*

**Решение:**

In [ ]:
# Сделаем resampling по дням
day_total = data.TotalCost.resample('D').sum()

# Посмотрим результат
print ("Сумма заказов по дням(head):\n",day_total.head())

#Сделаем resampling по неделям и разделим на 7. Получится среднее значение по всем неделям
print ("\nСреднее скользящее по неделям(head):\n")

# Берем переменную day_total
(day_total.resample('W').sum() / 7).head()

Сумма заказов по дням(head):
 InvoiceDate
2010-12-01    58635.56
2010-12-02    46207.28
2010-12-03    45620.46
2010-12-04        0.00
2010-12-05    31383.95
Freq: D, Name: TotalCost, dtype: float64

Среднее скользящее по неделям(head):

InvoiceDate
2010-12-05    25978.178571
2010-12-12    38612.432857
2010-12-19    29578.881429
2010-12-26    12824.367143
2011-01-02        0.000000
Freq: W-SUN, Name: TotalCost, dtype: float64

In [ ]:
# Или можно сделать проще,
# как можно подсчитать среднюю сумму ежедневных заказов за каждую неделю. 
# Для этого сумму за неделю разделим на 7 

# Например, если брать неделю с 2010-12-06 по 2010-12-12, 
# то по дням будет (53860.18 + 45059.04 + 44189.84 + 52532.13 + 57404.91 + 0 + 17240) - просто для проверки
# И подсчитаем среднее значение разделив эту сумму на 7 дней в неделе, получим за неделю 2010-12-12 : 38612.43 (вторая строка)

week_mean = data.TotalCost.resample('W').sum() / 7

# Выведем результат за все время по неделям
week_mean.head()

# Результат такой же

InvoiceDate
2010-12-05    25978.178571
2010-12-12    38612.432857
2010-12-19    29578.881429
2010-12-26    12824.367143
2011-01-02        0.000000
Freq: W-SUN, Name: TotalCost, dtype: float64

In [ ]:
# Так же можно подсчитать среднее значение каждого заказа по дням и неделям
# Найдем среднее значение по дням
day_mean = data.TotalCost.resample('D').mean()

# В итоге видим. Например,что в среднем каждый заказ 6 декабря был на 13.88 , а 7 декабря на 15.20 и так далее
print("Пример одной недели:\nСредняя цена за заказ по дням:\n\n",day_mean['2010-12-06' : '2010-12-12'])

# Теперь подсчитам среднее значение по неделям исходя из средних значений за день.

print ("\nСредняя цена заказа в каждой конкретной недели:\n")
data.TotalCost.resample('W').mean()

# Например видим, что среднея цена одного заказа за неделю 2010-12-12 была: 16.29 (вторая строчка)

Пример одной недели:
Средняя цена за заказ по дням:

 InvoiceDate
2010-12-06    13.888649
2010-12-07    15.207239
2010-12-08    16.694311
2010-12-09    18.170920
2010-12-10    20.813963
2010-12-11          NaN
2010-12-12    11.882095
Freq: D, Name: TotalCost, dtype: float64

Средняя цена заказа в каждой конкретной недели:

InvoiceDate
2010-12-05    17.926582
2010-12-12    16.294130
2010-12-19    18.576366
2010-12-26    19.502622
2011-01-02          NaN
2011-01-09    12.219156
2011-01-16    21.605765
2011-01-23    14.239799
2011-01-30    15.406286
2011-02-06    17.678321
2011-02-13    17.840413
2011-02-20    19.751744
2011-02-27    17.326814
2011-03-06    17.690975
2011-03-13    17.281734
2011-03-20    17.751755
2011-03-27    17.460725
2011-04-03    20.445873
2011-04-10    15.295374
2011-04-17    19.603798
2011-04-24    14.343012
2011-05-01    17.384149
2011-05-08    16.284111
2011-05-15    20.039527
2011-05-22    20.738457
2011-05-29    21.435031
2011-06-05    17.338749
2011-06-12    18.779488
2011-06-19    21.805486
2011-06-26    14.115336
2011-07-03    19.948396
2011-07-10    16.464854
2011-07-17    13.922760
2011-07-24    18.413434
2011-07-31    21.395675
2011-08-07    19.233576
2011-08-14    21.105782
2011-08-21    24.199134
2011-08-28    18.522162
2011-09-04    14.881939
2011-09-11    18.573995
2011-09-18    20.237299
2011-09-25    23.876773
2011-10-02    17.022567
2011-10-09    20.936291
2011-10-16    15.452504
2011-10-23    19.320409
2011-10-30    16.473988
2011-11-06    17.262517
2011-11-13    17.987239
2011-11-20    18.018547
2011-11-27    15.447871
2011-12-04    16.910287
2011-12-11    16.977591
Freq: W-SUN, Name: TotalCost, dtype: float64

### Задача 3. GroupBy

Посчитайте общую стоимость заказов на ежемесячной основе в разбивке по странам.

**Решение:**

In [ ]:
# Сгруппируем по странам. И в каждой отдельной стране посчитаем общую сумму заказов за каждый месяц.
country_month = data.groupby('Country').TotalCost.resample('M').sum()

# Выведем сохраненный результат
country_month

Country      InvoiceDate
Australia    2010-12-31      1005.10
             2011-01-31      9017.71
             2011-02-28     14627.47
             2011-03-31     17055.29
             2011-04-30       333.40
                              ...
Unspecified  2011-07-31      1425.41
             2011-08-31       531.03
             2011-09-30       286.85
             2011-10-31         0.00
             2011-11-30       965.75
Name: TotalCost, Length: 378, dtype: float64

In [ ]:
# Так же можно посчитать общую сумму за год по каждой отдельной стране  (К задаче не относится)
data.groupby('Country').TotalCost.resample('Y').sum()

Country               InvoiceDate
Australia             2010-12-31     1.005100e+03
                      2011-12-31     1.360722e+05
Austria               2010-12-31     2.570400e+02
                      2011-12-31     9.897280e+03
Bahrain               2010-12-31     2.057400e+02
                                         ...
USA                   2011-12-31     1.730920e+03
United Arab Emirates  2011-12-31     1.902280e+03
United Kingdom        2010-12-31     6.767426e+05
                      2011-12-31     7.511064e+06
Unspecified           2011-12-31     4.749790e+03
Name: TotalCost, Length: 61, dtype: float64

### Задача 4. JOIN

* Подгрузите данные, содержащие информацию о номерах карт лояльности пользователей (card_data.csv).
* Назовите ее cards.
* Сделайте Left Join исходной таблицы (которая получилась после задачи с datetime индексом) и таблицы cards.
* Если будет переполнение памяти, попробуйте взять не все значения таблицы, а, например, первые 100 с помощью соответствующего метода iloc.

**Решение:**

In [ ]:
cards = pd.read_csv('/content/drive/MyDrive/NU/04 Pandas/card_data.csv')

# Выведем dataFrame, чтобы посмотреть какие в нем есть данные
cards.head()

   CustomerID  TransactionNum
0     17850.0             127
1     17850.0             414
2     17850.0             296
3     17850.0             409
4     17850.0             309

In [ ]:
# Используем метод merge для объединения двух dataFrame. 
# Чтобы не было переполнения памяти объединим первые 100 строк

data.iloc[:100].merge(cards, on = 'CustomerID', how = 'left')

      InvoiceNo StockCode  ... TotalCost  TransactionNum
0        536365    85123A  ...      15.3             127
1        536365    85123A  ...      15.3             414
2        536365    85123A  ...      15.3             296
3        536365    85123A  ...      15.3             409
4        536365    85123A  ...      15.3             309
...         ...       ...  ...       ...             ...
27665    536378     84991  ...      13.2             224
27666    536378     84991  ...      13.2             166
27667    536378     84991  ...      13.2             440
27668    536378     84991  ...      13.2             399
27669    536378     84991  ...      13.2             370

[27670 rows x 9 columns]

In [ ]:
# Так как по умолчанию (default) такие параметры как on использую общую колонку для объединения двух dataFrame
# и парметр how - будет left, то их можно не указывать. Результат будет такой же.

data.iloc[:100].merge(cards)

      InvoiceNo StockCode  ... TotalCost  TransactionNum
0        536365    85123A  ...      15.3             127
1        536365    85123A  ...      15.3             414
2        536365    85123A  ...      15.3             296
3        536365    85123A  ...      15.3             409
4        536365    85123A  ...      15.3             309
...         ...       ...  ...       ...             ...
27665    536378     84991  ...      13.2             224
27666    536378     84991  ...      13.2             166
27667    536378     84991  ...      13.2             440
27668    536378     84991  ...      13.2             399
27669    536378     84991  ...      13.2             370

[27670 rows x 9 columns]

In [ ]:
# Если хотим чтобы объединение было по dataFrame - cards в парметре how используем right

data.iloc[:100].merge(cards, how = 'right')

       InvoiceNo StockCode  ... TotalCost  TransactionNum
0         536365    85123A  ...     15.30             127
1         536365     71053  ...     20.34             127
2         536365    84406B  ...     22.00             127
3         536365    84029G  ...     20.34             127
4         536365    84029E  ...     20.34             127
...          ...       ...  ...       ...             ...
568313       NaN       NaN  ...       NaN             197
568314       NaN       NaN  ...       NaN             148
568315       NaN       NaN  ...       NaN             237
568316       NaN       NaN  ...       NaN             476
568317       NaN       NaN  ...       NaN             305

[568318 rows x 9 columns]

In [ ]:
# Так же можно объединить два dataFrame с помощью метода .join
# И можно в качестве индекса использовать общую для них колонку - CustomerID

data.iloc[:100].set_index('CustomerID').join(cards.set_index('CustomerID'))

           InvoiceNo StockCode  ... TotalCost  TransactionNum
CustomerID                      ...
12583.0       536370     22728  ...      90.0             149
12583.0       536370     22728  ...      90.0             138
12583.0       536370     22728  ...      90.0             307
12583.0       536370     22728  ...      90.0             359
12583.0       536370     22728  ...      90.0              61
...              ...       ...  ...       ...             ...
17850.0       536377     22633  ...      11.1             195
17850.0       536377     22633  ...      11.1              15
17850.0       536377     22633  ...      11.1             323
17850.0       536377     22633  ...      11.1             199
17850.0       536377     22633  ...      11.1             429

[27670 rows x 8 columns]

### Задача 5

Выведите квантили 0.4 и 0.6 по численным данным новой таблицы там, где это имеет смысл.

**Решение:**

In [ ]:
# Актуальные для нас будут столбцы  Количество - Quantity, Цена товара - UnitPrice и Общая сумма  TotalCost
# По другим колонкам квантиль смысла делать нет.

data[['Quantity','UnitPrice','TotalCost']].quantile([0.4 , 0.6])

     Quantity  UnitPrice  TotalCost
0.4       2.0       1.65        6.3
0.6       5.0       2.55       12.6

In [ ]:
# Или для выбора определенных столбцов можно использовать метод .loc

data.loc[:,['Quantity','UnitPrice','TotalCost']].quantile([0.4 , 0.6])

     Quantity  UnitPrice  TotalCost
0.4       2.0       1.65        6.3
0.6       5.0       2.55       12.6